#ifndef __DELAY_H
#define __DELAY_H

#include "stm32f4xx_hal.h"

/********************************************************************************
***********使用SysTick的普通技计数模式对延时进行管理
***********包括delay_us和delay_ms
***********
***********
***********
***********
***********
***********
***********
***********
***********
***********
********************************************************************************/







void delay_init(uint8_t SYSCLK);
void delay_ms(uint16_t nms);
void delay_us(uint32_t nus);






#endif
